# Pandas
=> pandas is an open source module built on top of numpy.
=> Its allows for fast analyis, Data cleaning and prepartion of the data.
=> It Excels in perfomance in Productivity
=> Its also has built in visualization features
=> It can work with wide varity of data
=> It contains
    => Series
    => Data Frames
    => Missing Data
    => Group BY
    => Merging, Joining and Concatinating
    => Operations
    => Data input and outputs

# Series

In [4]:
import numpy as np
import pandas as pd

# Labels
labels = ['a','b','c']
data = [10,20,30]
arr = np.array(data)
dict = {'a':10,'b':20,'c':30}

labels

['a', 'b', 'c']

In [5]:
data

[10, 20, 30]

In [6]:
arr

array([10, 20, 30])

In [7]:
dict

{'a': 10, 'b': 20, 'c': 30}

In [9]:
pd.Series(data)

0    10
1    20
2    30
dtype: int64

In [11]:
pd.Series(data,index=labels)

a    10
b    20
c    30
dtype: int64

In [12]:
pd.Series(data,labels)

a    10
b    20
c    30
dtype: int64

In [13]:
pd.Series(arr,index=['a','b','c'])

a    10
b    20
c    30
dtype: int32

In [14]:
pd.Series(dict)

a    10
b    20
c    30
dtype: int64

In [15]:
#pd. Series(Data, index)
country_capitals = pd.Series(['India','USA','Canada','Chaina'],['Delhi','Washington DC','Uttavo','Bejling'])
country_capitals

Delhi             India
Washington DC       USA
Uttavo           Canada
Bejling          Chaina
dtype: object

In [16]:
country_capitals = pd.Series(['Delhi','Washington DC','Uttavo','Bejling'],['India','USA','Canada','Chaina'])
country_capitals

India             Delhi
USA       Washington DC
Canada           Uttavo
Chaina          Bejling
dtype: object

# Data Frame

In [6]:
import numpy as np
import pandas as pd
df = pd.DataFrame(np.random.randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [5]:
df = pd.DataFrame(np.random.rand(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  0.924238  0.919482  0.722825  0.976931
B  0.908775  0.374313  0.472080  0.987257
C  0.642946  0.309307  0.229932  0.920613
D  0.580673  0.765211  0.791609  0.783044
E  0.061748  0.396132  0.384950  0.743484

In [7]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [8]:
type(df['W'])

pandas.core.series.Series

In [12]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [13]:
df['New']= df['W']+df['Z']
df

          W         X         Y         Z       New
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [14]:
df.drop('New',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [15]:
df

          W         X         Y         Z       New
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [16]:
df.drop('New',axis=1,inplace=True)

In [17]:
df #inplace=True ==> drop perminatly

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [18]:
df.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [19]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
#df.drop('E',axis=0,inplace=True) #inplace=True then removes E row perminatly. by defualt inplace = False
# by default is AXIS = 0 
df.shape

(4, 4)

In [23]:
#two method to display the rows
df.loc['B']

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [25]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [28]:
df.loc['C']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [29]:
#index location #its takes only location that is integer values
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [30]:
df.loc['D','W']

0.18869530944922425

In [31]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [32]:
# to display selected rows and columns
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

# Conditional Selection

In [33]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [34]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True

In [35]:
booldf = df>0

In [36]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True

In [37]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057

In [38]:
booldf[booldf>0]

     W    X    Y    Z
A  1.0  1.0  1.0  1.0
B  1.0  NaN  NaN  1.0
C  NaN  1.0  1.0  NaN
D  1.0  NaN  NaN  1.0

In [39]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True

In [40]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [41]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [42]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [43]:
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [44]:
df[df['Z']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [45]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [46]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [47]:
df[df['W']>0][['Y']]

          Y
A  0.907969
B -0.848077
D -0.933237

In [48]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872

In [51]:
boolSer = df['W']>0
boolSer

A     True
B     True
C    False
D     True
Name: W, dtype: bool

In [53]:
result = df[boolSer]
result

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [55]:
mycolumns = ['Y','X']
result[mycolumns]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872

In [56]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [57]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872

In [60]:
boolres = df['W']>0
result = df[boolres]
cols = ['Y','X']
result[cols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872

In [63]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [66]:
df[(df['W']>2) & (df['Y']>0)]

         W         X         Y         Z
A  2.70685  0.628133  0.907969  0.503826

In [67]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [69]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057

In [70]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [72]:
newIndex = 'CA NY WY OR'.split()
newIndex

['CA', 'NY', 'WY', 'OR']

In [74]:
df['States']=newIndex

In [75]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR

In [77]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057

In [84]:
import numpy as np
import pandas as pd
#index levels
outsider = ['G1','G1','G1','G2','G2','G2']
insider = [1,2,3,1,2,3]
hier_index = list(zip(outsider,insider))
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [85]:
hier_index=pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [92]:
df = pd.DataFrame(np.random.rand(6,3),hier_index,['A','B','C'])
df

             A         B         C
G1 1  0.048169  0.903971  0.080104
   2  0.607216  0.630847  0.377942
   3  0.013241  0.842219  0.384938
G2 1  0.551666  0.710538  0.675279
   2  0.694565  0.342457  0.412391
   3  0.239791  0.968836  0.288557

In [94]:
df.index.names

FrozenList([None, None])

In [95]:
df.index.names=['Groups','Num']

In [97]:
df

             A         B         C
G1 1  0.048169  0.903971  0.080104
   2  0.607216  0.630847  0.377942
   3  0.013241  0.842219  0.384938
G2 1  0.551666  0.710538  0.675279
   2  0.694565  0.342457  0.412391
   3  0.239791  0.968836  0.288557

In [98]:
df.index.names=['Groups','Num']

In [99]:
df

                   A         B         C
Groups Num
G1     1    0.048169  0.903971  0.080104
       2    0.607216  0.630847  0.377942
       3    0.013241  0.842219  0.384938
G2     1    0.551666  0.710538  0.675279
       2    0.694565  0.342457  0.412391
       3    0.239791  0.968836  0.288557

In [100]:
df.loc['G2']

            A         B         C
Num
1    0.551666  0.710538  0.675279
2    0.694565  0.342457  0.412391
3    0.239791  0.968836  0.288557

In [101]:
df.loc['G2'].loc[2]['C']

0.4123905636723606

In [103]:
df.loc['G1']

            A         B         C
Num
1    0.048169  0.903971  0.080104
2    0.607216  0.630847  0.377942
3    0.013241  0.842219  0.384938

In [105]:
df.xs(1,level='Num')

               A         B         C
Groups
G1      0.048169  0.903971  0.080104
G2      0.551666  0.710538  0.675279

# Missing Data

In [107]:
import numpy as np
import pandas as pd

dict = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}
dict

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [108]:
df = pd.DataFrame(dict)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [109]:
#if any column value will be NaN, then drop the row
df.dropna()

     A    B  C
0  1.0  5.0  1

In [110]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [114]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [115]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [116]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [117]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [118]:
df.dropna(thresh=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [119]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [120]:
df.fillna(value=0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [121]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [123]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [125]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [126]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [127]:
df['B'].fillna(value=df['B'].mean())

0    5.0
1    5.0
2    5.0
Name: B, dtype: float64

# Group BY

In [128]:
import numpy as np
import pandas as pd

input_data = (
                {
                    'Company':['GOOGLE','GOOGLE','MSFT','MSFT','FB','FB'],
                    'Person':['Sam','Sai','Ram','Venkata','Rod','Quentin'],
                    'Sales':[200,1000,120,140,260,270]
                }
              )
df = pd.DataFrame(input_data)
df

  Company   Person  Sales
0  GOOGLE      Sam    200
1  GOOGLE      Sai   1000
2    MSFT      Ram    120
3    MSFT  Venkata    140
4      FB      Rod    260
5      FB  Quentin    270

In [129]:
df.groupby('Company')

In [130]:
df.groupby('Company').mean()

         Sales
Company
FB         265
GOOGLE     600
MSFT       130

In [131]:
df.groupby('Company').sum()

         Sales
Company
FB         530
GOOGLE    1200
MSFT       260

In [132]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min    25%    50%    75%     max
Company
FB        2.0  265.0    7.071068  260.0  262.5  265.0  267.5   270.0
GOOGLE    2.0  600.0  565.685425  200.0  400.0  600.0  800.0  1000.0
MSFT      2.0  130.0   14.142136  120.0  125.0  130.0  135.0   140.0

In [133]:
df.groupby('Company').sum().loc['FB']

Sales    530
Name: FB, dtype: int64

In [134]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOGLE        2      2
MSFT          2      2

In [135]:
df.groupby('Company').max()

          Person  Sales
Company
FB           Rod    270
GOOGLE       Sam   1000
MSFT     Venkata    140

In [136]:
df.groupby('Company').min()

          Person  Sales
Company
FB       Quentin    260
GOOGLE       Sai    200
MSFT         Ram    120

In [137]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min    25%    50%    75%     max
Company
FB        2.0  265.0    7.071068  260.0  262.5  265.0  267.5   270.0
GOOGLE    2.0  600.0  565.685425  200.0  400.0  600.0  800.0  1000.0
MSFT      2.0  130.0   14.142136  120.0  125.0  130.0  135.0   140.0

In [138]:
df.groupby('Company').describe().transpose()

Company              FB       GOOGLE        MSFT
Sales count    2.000000     2.000000    2.000000
      mean   265.000000   600.000000  130.000000
      std      7.071068   565.685425   14.142136
      min    260.000000   200.000000  120.000000
      25%    262.500000   400.000000  125.000000
      50%    265.000000   600.000000  130.000000
      75%    267.500000   800.000000  135.000000
      max    270.000000  1000.000000  140.000000

# Mergong, Joining and Concatenating

In [139]:
import numpy as np
import pandas as pd

input_data1= pd.DataFrame({
                            'A':['A0','A1','A2','A3','A4'],
                            'B':['B0','B1','B2','B3','B4'],
                            'C':['C0','C1','C2','C3','C4'],
                            'D':['D0','D1','D2','D3','D4'],
    
                         }, index=[0,1,2,3,4])


input_data2= pd.DataFrame({
                            'A':['A4','A5','A6','A7','A8'],
                            'B':['B4','B5','B6','B7','B8'],
                            'C':['C4','C5','C6','C7','C8'],
                            'D':['D4','D5','D6','D7','D8'],
    
                         }, index=[4,5,6,7,8])
input_data3= pd.DataFrame({
                            'A':['A8','A9','A10','A11','A12'],
                            'B':['B8','B9','B10','B11','B12'],
                            'C':['C8','C9','C10','C11','C12'],
                            'D':['D8','D9','D10','D11','D12'],
    
                         }, index=[8,9,10,11,12])
input_data1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4

In [140]:
input_data2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7
8  A8  B8  C8  D8

In [141]:
input_data3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11
12  A12  B12  C12  D12

In [143]:
pd.concat([input_data1,input_data2,input_data3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11
12  A12  B12  C12  D12

In [144]:
pd.concat([input_data1,input_data2,input_data3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4    A4   B4   C4   D4   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN   A8   B8   C8   D8   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11
12  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A12  B12  C12  D12

In [145]:
left = pd.DataFrame({
                    'Key':['K0','K1','K2','K3'],
                    'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3']
                  })
right = pd.DataFrame({
                    'Key':['K0','K1','K2','K3'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']
                  })

In [146]:
left

  Key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [147]:
right

  Key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [148]:
pd.concat([left,right])

C:\Users\Venkata Sai\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     A    B    C    D Key
0   A0   B0  NaN  NaN  K0
1   A1   B1  NaN  NaN  K1
2   A2   B2  NaN  NaN  K2
3   A3   B3  NaN  NaN  K3
0  NaN  NaN   C0   D0  K0
1  NaN  NaN   C1   D1  K1
2  NaN  NaN   C2   D2  K2
3  NaN  NaN   C3   D3  K3

In [150]:
pd.merge(left,right,how='inner',on='Key')

  Key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [151]:
pd.merge(left,right,how='outer',on='Key')

  Key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [152]:
pd.merge(left,right,how='right',on='Key')

  Key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3